Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StairNotEnoughBoundaryCurvesError { get; }
  Visual Basic
Public Shared ReadOnly Property StairNotEnoughBoundaryCurvesError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StairNotEnoughBoundaryCurvesError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace